newwms_gift/src/Documents/ДополнительныеНачисления/ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДополнительныеНачисления</name>
  <registerRecords>InformationRegister.ДополнительныеНачисленияРаботниковСклада</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.СменыРаботниковСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласованно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСогласования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РаботникиСклада</name>
    <attributes>
      <name>РаботникСклада</name>
      <type>
        <types>CatalogRef.итWMSРаботникиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>РаботникСклада</name>
      <type>
        <types>CatalogRef.итWMSРаботникиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДополнительныхРабот</name>
      <type>
        <types>CatalogRef.ВидыДополнительныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачисленоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/InformationRegisters/ДополнительныеНачисленияРаботниковСклада/ДополнительныеНачисленияРаботниковСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеНачисленияРаботниковСклада</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Начислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РаботникСклада</name>
    <type>
      <types>CatalogRef.итWMSРаботникиСклада</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.СменыРаботниковСклада</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДополнительныхРабот</name>
    <type>
      <types>CatalogRef.ВидыДополнительныхРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/Documents/ДополнительныеНачисления/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НаличиеДокументовНаТекущуДатуНачисленияИСмену() Тогда 
		Отказ=Истина;
	КонецЕсли;	
	Если не ПроверитьЗаполнение() Тогда 
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры

Функция НаличиеДокументовНаТекущуДатуНачисленияИСмену()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеНачисления.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ДополнительныеНачисления КАК ДополнительныеНачисления
		|ГДЕ
		|	ДополнительныеНачисления.Ссылка <> &Ссылка
		|	И ДополнительныеНачисления.ДатаНачисления = &ДатаНачисления
		|	И ДополнительныеНачисления.Смена = &Смена
		|	И ДополнительныеНачисления.Проведен";
	
	Запрос.УстановитьПараметр("ДатаНачисления", ДатаНачисления);
	Запрос.УстановитьПараметр("Смена", Смена);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("на текущую дату начисления уже имеется регистратор "+Строка(ВыборкаДетальныеЗаписи.Ссылка));
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если не Согласованно Тогда 
		Возврат
	КонецЕсли;	
	ДополнительныеНачисленияРаботниковСклада=Движения.ДополнительныеНачисленияРаботниковСклада;
	ДополнительныеНачисленияРаботниковСклада.Записывать=Истина;
	Для Каждого стр из Начисления Цикл 
		Запись=ДополнительныеНачисленияРаботниковСклада.Добавить();
		Запись.ВидДополнительныхРабот=стр.ВидДополнительныхРабот;
		Запись.ДатаНачисления=ДатаНачисления;
		Запись.Начислено=стр.НачисленоФакт;
		Запись.Регистратор=Ссылка;
		Запись.Организация=Организация;
		Запись.РаботникСклада=Стр.РаботникСклада;
		Запись.Согласовал=Согласовал;
		Запись.Смена=Смена;
	КонецЦикла;
	ДополнительныеНачисленияРаботниковСклада.Записать();
КонецПроцедуры
